meeting/agenda/2026/03-10.org
:PROPERTIES:
:ID:       3C0C452F-AC14-400F-881A-1B0610F9808A
:END:
#+title: QT4 CG Meeting 155 Agenda 2026-03-10
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 12:00EDT).

Note: Daylight Saving Time began in North America on Sunday, 8 March. It does
not begin in the UK and Europe until Sunday, 29 March. The QT4 CG
meets on UK and European civil time. The meetings of 10, 17, and 24 March will
be *one hour later* in North America.

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for more details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2026/03-03.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 10 March 2026.

The next meeting is planned for 17 March 2026.

** Review of open action items [2/14]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

+ [ ] QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests
+ [ ] QT4CG-143-03: JK to look for C14N test suites.
+ [ ] QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.
+ [X] QT4CG-149-01: CG to draft a new PR with the common rule note.
+ [ ] QT4CG-150-01: NW to ask Jirka for a room at XML Prague for Tuesday/Wednesday
+ [ ] QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion
+ [ ] QT4CG-151-01: MK to fix the typo in the build-dateTime function.
+ [X] QT4CG-151-03: NW to investigate why records are formatted incorrectly in XSLT
+ [ ] QT4CG-152-01: MK to add a note about the new and old syntax for names in PR #2446
+ [ ] QT4CG-153-01: MK to investigate the indentation problem.
+ [ ] QT4CG-153-02: MK to turn my suggestions on #1949 into a PR.
+ [ ] QT4CG-154-01: MK to review why anyAtomicType didn’t, in fact, become a square box!
+ [ ] QT4CG-154-02: MK to add a note about “tunneling” package parameters.
+ [ ] QT4CG-154-03: NW to make sure that the streaming spec goes in the diff list

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-2266][#2266]]: 540 system-property equivalent for XQuery
+ PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]]: 2073 data model changes for JNodes and Sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]: 77c deep update
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-2509][#2509]]: 2477 Get current date in streaming spec
+ PR [[https://qt4cg.org/dashboard/#pr-2507][#2507]]: 2498 Change output of type-of() when applied to a JNode

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-2510][#2510]]: Alternate proposal for #2460
+ PR [[https://qt4cg.org/dashboard/#pr-2509][#2509]]: 2477 Get current date in streaming spec
+ PR [[https://qt4cg.org/dashboard/#pr-2508][#2508]]: 2353 (stylesheet change)
+ PR [[https://qt4cg.org/dashboard/#pr-2506][#2506]]: 2500 Coerce the target of a dynamic function call
+ PR [[https://qt4cg.org/dashboard/#pr-2505][#2505]]: 2503 Clarify validity of dateTime-record
+ PR [[https://qt4cg.org/dashboard/#pr-2504][#2504]]: Propose a minimalist alternative for generators in order to stimulate some discussion.
+ PR [[https://qt4cg.org/dashboard/#pr-2501][#2501]]: 2499 default priority of predicate patterns
+ PR [[https://qt4cg.org/dashboard/#pr-2478][#2478]]: 2476 guaranteed streamability
+ PR [[https://qt4cg.org/dashboard/#pr-2470][#2470]]: 1310 Functions fn:regex and ?matching-substrings
+ PR [[https://qt4cg.org/dashboard/#pr-2467][#2467]]: Harmonize the fn: and file: functions that read text
+ PR [[https://qt4cg.org/dashboard/#pr-2350][#2350]]: 708 An alternative proposal for generators
+ PR [[https://qt4cg.org/dashboard/#pr-2345][#2345]]: 2299 Expand pipeline to allow arrow expression in path expression
+ PR [[https://qt4cg.org/dashboard/#pr-2313][#2313]]: 2298 XQFO rules: definition of default values
+ PR [[https://qt4cg.org/dashboard/#pr-2247][#2247]]: 716 Deferred Evaluation in XPath - the f:generator record
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Required for V4.0
:PROPERTIES:
:CUSTOM_ID: required-40
:END:

The following issues are labeled “required for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1777][#1777]]: Shallow copy in XSLT with maps and arrays
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1584][#1584]]: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility
+ Issue [[https://github.com/qt4cg/qtspecs/issues/675][#675]]: XSLT streaming rules for new constructs

*** Issues to be discussed
:PROPERTIES:
:CUSTOM_ID: issues-discuss
:END:

+ Issue [[https://github.com/qt4cg/qtspecs/issues/2462][#2462]]: Revert dynamic function calls on sequences

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** Issue #2462: Revert dynamic function calls on sequences
:PROPERTIES:
:CUSTOM_ID: iss-2462
:END:
See issue [[https://github.com/qt4cg/qtspecs/issues/2462][#2462]].
** PR #2510: Alternate proposal for #2460
:PROPERTIES:
:CUSTOM_ID: pr-2510
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2510][#2510]].
** PR #2509: 2477 Get current date in streaming spec
:PROPERTIES:
:CUSTOM_ID: pr-2509
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2509][#2509]].
** PR #2506: 2500 Coerce the target of a dynamic function call
:PROPERTIES:
:CUSTOM_ID: pr-2506
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2506][#2506]].
** PR #2505: 2503 Clarify validity of dateTime-record
:PROPERTIES:
:CUSTOM_ID: pr-2505
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2505][#2505]].
** PR #2504: Propose a minimalist alternative for generators in order to stimulate some discussion.
:PROPERTIES:
:CUSTOM_ID: pr-2504
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2504][#2504]].
** PR #2501: 2499 default priority of predicate patterns
:PROPERTIES:
:CUSTOM_ID: pr-2501
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2501][#2501]].
** PR #2478: 2476 guaranteed streamability
:PROPERTIES:
:CUSTOM_ID: pr-2478
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2478][#2478]].
** PR #2470: 1310 Functions fn:regex and ?matching-substrings
:PROPERTIES:
:CUSTOM_ID: pr-2470
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2470][#2470]].

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
