meeting/agenda/2026/03-10.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 155 Agenda 2026-03-10</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 155 Agenda 2026-03-10</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>
<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 12:00EDT).
</p>

<p>
Note: Daylight Saving Time began in North America on Sunday, 8 March. It does
not begin in the UK and Europe until Sunday, 29 March. The QT4 CG
meets on UK and European civil time. The meetings of 10, 17, and 24 March will
be <b>one hour later</b> in North America.
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for more details.
</p>
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>
<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2026/03-03.html">the previous meeting</a>.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 10 March 2026.
</p>

<p>
The next meeting is planned for 17 March 2026.
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[2/14]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-143-03: JK to look for C14N test suites.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.</li>
<li class="on"><code>[X]</code> QT4CG-149-01: CG to draft a new PR with the common rule note.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-01: NW to ask Jirka for a room at XML Prague for Tuesday/Wednesday</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-151-01: MK to fix the typo in the build-dateTime function.</li>
<li class="on"><code>[X]</code> QT4CG-151-03: NW to investigate why records are formatted incorrectly in XSLT</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-152-01: MK to add a note about the new and old syntax for names in PR #2446</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-153-01: MK to investigate the indentation problem.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-153-02: MK to turn my suggestions on #1949 into a PR.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-154-01: MK to review why anyAtomicType didn’t, in fact, become a square box!</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-154-02: MK to add a note about “tunneling” package parameters.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-154-03: NW to make sure that the streaming spec goes in the diff list</li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2266">#2266</a>: 540 system-property equivalent for XQuery</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2509">#2509</a>: 2477 Get current date in streaming spec</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2507">#2507</a>: 2498 Change output of type-of() when applied to a JNode</li>
</ul>
</div>
</div>
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.3.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2510">#2510</a>: Alternate proposal for #2460</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2509">#2509</a>: 2477 Get current date in streaming spec</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2508">#2508</a>: 2353 (stylesheet change)</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2506">#2506</a>: 2500 Coerce the target of a dynamic function call</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2505">#2505</a>: 2503 Clarify validity of dateTime-record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2504">#2504</a>: Propose a minimalist alternative for generators in order to stimulate some discussion.</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2501">#2501</a>: 2499 default priority of predicate patterns</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2478">#2478</a>: 2476 guaranteed streamability</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2470">#2470</a>: 1310 Functions fn:regex and ?matching-substrings</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2467">#2467</a>: Harmonize the fn: and file: functions that read text</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2350">#2350</a>: 708 An alternative proposal for generators</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2345">#2345</a>: 2299 Expand pipeline to allow arrow expression in path expression</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2313">#2313</a>: 2298 XQFO rules: definition of default values</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>: 716 Deferred Evaluation in XPath - the f:generator record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-required-40" class="outline-4">
<h4 id="required-40"><span class="section-number-4">1.6.4.</span> Required for V4.0</h4>
<div class="outline-text-4" id="text-required-40">
<p>
The following issues are labeled “required for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1777">#1777</a>: Shallow copy in XSLT with maps and arrays</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1584">#1584</a>: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/675">#675</a>: XSLT streaming rules for new constructs</li>
</ul>
</div>
</div>
<div id="outline-container-issues-discuss" class="outline-4">
<h4 id="issues-discuss"><span class="section-number-4">1.6.5.</span> Issues to be discussed</h4>
<div class="outline-text-4" id="text-issues-discuss">
<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2462">#2462</a>: Revert dynamic function calls on sequences</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
<div id="outline-container-iss-2462" class="outline-3">
<h3 id="iss-2462"><span class="section-number-3">2.1.</span> Issue #2462: Revert dynamic function calls on sequences</h3>
<div class="outline-text-3" id="text-iss-2462">
<p>
See issue <a href="https://github.com/qt4cg/qtspecs/issues/2462">#2462</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2510" class="outline-3">
<h3 id="pr-2510"><span class="section-number-3">2.2.</span> PR #2510: Alternate proposal for #2460</h3>
<div class="outline-text-3" id="text-pr-2510">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2510">#2510</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2509" class="outline-3">
<h3 id="pr-2509"><span class="section-number-3">2.3.</span> PR #2509: 2477 Get current date in streaming spec</h3>
<div class="outline-text-3" id="text-pr-2509">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2509">#2509</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2506" class="outline-3">
<h3 id="pr-2506"><span class="section-number-3">2.4.</span> PR #2506: 2500 Coerce the target of a dynamic function call</h3>
<div class="outline-text-3" id="text-pr-2506">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2506">#2506</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2505" class="outline-3">
<h3 id="pr-2505"><span class="section-number-3">2.5.</span> PR #2505: 2503 Clarify validity of dateTime-record</h3>
<div class="outline-text-3" id="text-pr-2505">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2505">#2505</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2504" class="outline-3">
<h3 id="pr-2504"><span class="section-number-3">2.6.</span> PR #2504: Propose a minimalist alternative for generators in order to stimulate some discussion.</h3>
<div class="outline-text-3" id="text-pr-2504">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2504">#2504</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2501" class="outline-3">
<h3 id="pr-2501"><span class="section-number-3">2.7.</span> PR #2501: 2499 default priority of predicate patterns</h3>
<div class="outline-text-3" id="text-pr-2501">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2501">#2501</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2478" class="outline-3">
<h3 id="pr-2478"><span class="section-number-3">2.8.</span> PR #2478: 2476 guaranteed streamability</h3>
<div class="outline-text-3" id="text-pr-2478">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2478">#2478</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2470" class="outline-3">
<h3 id="pr-2470"><span class="section-number-3">2.9.</span> PR #2470: 1310 Functions fn:regex and ?matching-substrings</h3>
<div class="outline-text-3" id="text-pr-2470">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2470">#2470</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
